
--INSERT INTO MEMBER (member_id, username, password, email, provider_type, role_type) VALUES
--("1","test", "NO_PASS","NO_EMAIL", "KAKAO	" ,"USER"),
--("2","test2", "NO_PASS2","NO_EMAIL2", "KAKAO" ,"USER");



INSERT INTO REVIEW_BOARD (local_name, mountain_name, course_name, title, body, photo) VALUES
 ('서울시', '관악산', '학바위능선', '리뷰제목1', '임의의 내용', '임의의 사진'),
 ('서울시', '관악산', '관악산봉우리', '리뷰제목2', '임의의 내용2', '임의의 사진2'),
 ('서울시', '북한산', '북한산봉우리', '리뷰제목3', '임의의 내용3', '임의의 사진3'),
 ('서울시', '도봉산', '도봉산봉우리', '리뷰제목4', '임의의 내용4', '임의의 사진4'),
 ('서울시', '수락산', '수락산봉우리', '리뷰제목5', '임의의 내용5', '임의의 사진5'),
 ('서울시', '청계산', '청계산봉우리', '리뷰제목6', '임의의 내용6', '임의의 사진6'),
 ('서울시', '불암산', '불암산봉우리', '리뷰제목7', '임의의 내용7', '임의의 사진7'),
 ('서울시', '삼성산', '삼성산봉우리', '리뷰제목8', '임의의 내용8', '임의의 사진8'),
 ('서울시', '호암산', '호암산봉우리', '리뷰제목9', '임의의 내용9', '임의의 사진9'),
 ('서울시', '용마산', '용마산봉우리', '리뷰제목10', '임의의 내용10', '임의의 사진10'),
 ('서울시', '백악산', '백악산봉우리', '리뷰제목11', '임의의 내용11', '임의의 사진11'),
 ('서울시', '인왕산', '인왕산봉우리', '리뷰제목12', '임의의 내용12', '임의의 사진12'),
 ('광명시', '도문산', '도문산봉우리', '리뷰제목13', '임의의 내용13', '임의의 사진13'),
 ('수원시', '광교산', '광교산봉우리', '리뷰제목14', '임의의 내용14', '임의의 사진14'),
 ('수원시', '팔달산', '팔달산봉우리', '리뷰제목15', '임의의 내용15', '임의의 사진15'),
 ('용인시', '보라산', '보라산봉우리', '리뷰제목16', '임의의 내용16', '임의의 사진16'),
 ('용인시', '함박산', '함박산봉우리', '리뷰제목17', '임의의 내용17', '임의의 사진17');

INSERT INTO TAG (tag_name) VALUES
('정상'),
('완등'),
('등산'),
('등린이'),
('날씨흐림'),
('날씨좋음'),
('날씨비'),
('산'),
('봉'),
('대'),
('100대명산'),
('200대명산'),
('400대명산'),
('백두대간'),
('한북정맥'),
('한남정맥'),
('금북정맥'),
('한남금북정맥'),
('금남호남정맥'),
('금남정맥'),
('호남정맥'),
('낙동정맥'),
('낙담정맥'),
('단풍');

